openwch/ch32v307/EVT/EXAM/USB/USBFS/HOST/User/ch32vf30x_usbfs_host.h
#define USBHD_UEP5_T_LEN       (*((PUINT8V)(0x50000044)))  // endpoint 5 transmittal length
#define USBHD_UEP5_TX_CTRL     (*((PUINT8V)(0x50000046)))  // endpoint 5 tx control
#define USBHD_UEP5_RX_CTRL     (*((PUINT8V)(0x50000047)))  // endpoint 5 rx control

#define USBHD_UEP6_T_LEN       (*((PUINT8V)(0x50000048)))  // endpoint 6 transmittal length
#define USBHD_UEP6_TX_CTRL     (*((PUINT8V)(0x5000004a)))  // endpoint 6 tx control
#define USBHD_UEP6_RX_CTRL     (*((PUINT8V)(0x5000004b)))  // endpoint 6 rx control


#define USBHD_UEP7_T_LEN       (*((PUINT8V)(0x5000004c)))  // endpoint 7 transmittal length
#define USBHD_UEP7_TX_CTRL     (*((PUINT8V)(0x5000004e)))  // endpoint 7 tx control
#define USBHD_UEP7_RX_CTRL     (*((PUINT8V)(0x5000004f)))  // endpoint 7 rx control



#define  USB_OTG_CR           (*((PUINT32V)(0x50000054)))  // usb otg control
#define     USB_OTG_CR_SESS           0x20               // usb otg control,会话电平使能
#define     USB_OTG_CR_VBUS           0x10               // usb otg control,VBUS电平使能
#define     USB_OTG_CR_OTG_EN         0x08               // usb otg control,OTG功能使能
#define     USB_OTG_CR_IDPU           0x04               // usb otg control,ID引脚上拉
#define     USB_OTG_CR_CHARGEVBUS     0x02               // usb otg control,VBUS充电
#define     USB_OTG_CR_DISCHARGEVBUS  0x01               // usb otg control,VBUS放电

#define  USB_OTG_SR          (*((PUINT32V)(0x50000058)))  // usb otg status
#define     USB_OTG_SR_VBUS_VLD       0x01               // usb otg status,A设备VBUS输入电平有效
#define     USB_OTG_SR_SESS_VLD       0x02               // usb otg status,会话有效电平有效标志
#define     USB_OTG_SR_SESS_END       0x04               // usb otg status,会话结束电平有效标志
#define     USB_OTG_SR_ID_DIG         0x08               // usb otg status,ID电平


/* USBHS PHY Clock Config (RCC_CFGR2) 使用USBHS PHY时钟的情况下，需要用到这些宏定义 */
#ifndef  USBHS_EXIST
#define USB_48M_CLK_SRC_MASK   (1<<31)
#define USB_48M_CLK_SRC_SYS    (0<<31)
#define USB_48M_CLK_SRC_PHY    (1<<31)

#define USBHS_PLL_ALIVE        (1<<30)

#define USBHS_PLL_CKREF_MASK   (3<<28)
#define USBHS_PLL_CKREF_3M     (0<<28)
#define USBHS_PLL_CKREF_4M     (1<<28)
#define USBHS_PLL_CKREF_8M     (2<<28)
#define USBHS_PLL_CKREF_5M     (3<<28)

#define USBHS_PLL_SRC_MASK     (1<<27)
#define USBHS_PLL_SRC_HSE      (0<<27)
#define USBHS_PLL_SRC_HSI      (1<<27)

#define USBHS_PLL_SRC_PRE_MASK (7<<24)
#define USBHS_PLL_SRC_PRE_DIV1 (0<<24)
#define USBHS_PLL_SRC_PRE_DIV2 (1<<24)
#define USBHS_PLL_SRC_PRE_DIV3 (2<<24)
#define USBHS_PLL_SRC_PRE_DIV4 (3<<24)
#define USBHS_PLL_SRC_PRE_DIV5 (4<<24)
#define USBHS_PLL_SRC_PRE_DIV6 (5<<24)
#define USBHS_PLL_SRC_PRE_DIV7 (6<<24)

/* 端点大小定义 */
#define DEF_USB_FS_EP_SIZE      64
#endif

/*使用sysclk时钟的情况下，需要用到这些宏定义 */
#define RCC_USBFS_CLK_DIV_1   (0<<22)
#define RCC_USBFS_CLK_DIV_2   (1<<22)
#define RCC_USBFS_CLK_DIV_3   (2<<22)
#define RCC_USBFS_CLK_SRC     (1<<31)




#ifndef __PACKED
#define __PACKED            __attribute__((packed))
#endif

typedef struct
{
    UINT16  InEndpMaxSize;          // IN  端点最大包大小
    UINT16  OutEndpMaxSize;
    UINT8   InEndpNum;              // IN  端点号
    UINT8   InEndpCount;              // IN  端点号
    UINT8   InTog;                  // IN 同步标志
    UINT8   OutEndpNum;             // OUT 端点号
    UINT8   OutEndpCount;              // IN  端点号
    UINT8   OutTog;
           // 最大逻辑单元号
}DEVENDP;

typedef struct  USB_STATUS
{
    DEVENDP DevEndp;
    UINT8   DeviceStatus;           // 设备状态,0-无设备,1-有设备但尚未初始化,2-有设备但初始化枚举失败,3-有设备且初始化枚举成功
    UINT8   DeviceAddress;          // 设备被分配的USB地址
    UINT8   DeviceSpeed;            // 0为全速,1为高速，2为低速
    UINT8   DeviceType;             // 设备类型：08-磁盘   0x30-HID  0x31-KEYBOARD  0x32-MOUSE
    UINT8   DeviceEndp0Size;        // USB0设备的端点0的最大包尺寸
    UINT8   DeviceCongValue;        // 设备配置值

}USBHS_HOST,*PUSBHS_HOST;

#define ERR_SUCCESS          0x00
#define ERR_USB_CONNECT      0x15
#define ERR_USB_DISCON       0x16
#define ERR_USB_BUF_OVER     0x17
#define ERR_USB_DISK_ERR     0x1F
#define ERR_USB_TRANSFER     0x20
#define ERR_USB_UNSUPPORT    0xFB
#define ERR_USB_UNKNOWN      0xFE
#define ERR_AOA_PROTOCOL     0x41

#define ROOT_DEV_DISCONNECT    0
#define ROOT_DEV_CONNECTED     1
#define ROOT_DEV_FAILED        2
#define ROOT_DEV_SUCCESS       3
#define DEV_TYPE_KEYBOARD     ( USB_DEV_CLASS_HID | 0x20 )
#define DEV_TYPE_MOUSE        ( USB_DEV_CLASS_HID | 0x30 )
#define DEF_AOA_DEVICE         0xF0
#define DEV_TYPE_UNKNOW        0xFF

#define HUB_MAX_PORTS           4
#define WAIT_USB_TOUT_200US     3000


#define USBOTG_EP1          1
#define USBOTG_EP2          2
#define USBOTG_EP3          3
#define USBOTG_EP4          4
#define USBOTG_EP5          5
#define USBOTG_EP6          6
#define USBOTG_EP7          7
/*******************变量外扩*******************/
extern UINT8 FoundNewDev;
extern __attribute__ ((aligned(16))) UINT8 endpRXbuff[]; //端点1数据收发缓冲区
extern __attribute__ ((aligned(16))) UINT8 endpTXbuff[]; //端点3数据收发缓冲区
/*******************函数外扩*******************/
extern void  OTG_RCC_Init(void);
extern void  USBOTG_HostInit(FunctionalState stus);
extern void  DisableRootHubPort(void);
extern UINT8 AnalyzeRootHub(void);
extern void  SetHostUsbAddr( PUSBHS_HOST pdev, UINT8 addr );
extern void  SetUsbSpeed(UINT8 FullSpeed);
extern void  ResetRootHubPort(void);
extern UINT8 EnableRootHubPort(void);
extern UINT8 WaitUSB_Interrupt(void);
extern UINT8 USBHostTransact(UINT8 endp_pid, UINT8 tog, UINT32 timeout);
extern UINT8 HostCtrlTransfer(PUINT8 DataBuf, PUINT8 RetLen);
extern void  CopySetupReqPkg( const UINT8 *pReqPkt);
extern UINT8 CtrlGetDeviceDescr(PUINT8 DataBuf);
extern UINT8 CtrlGetConfigDescr(PUSBHS_HOST pdev, PUINT8 DataBuf );
extern UINT8 CtrlSetUsbAddress( PUSBHS_HOST pdev,UINT8 addr );
extern UINT8 CtrlSetUsbConfig(UINT8 cfg);
extern UINT8 CtrlClearEndpStall(UINT8 endp);
extern UINT8 CtrlSetUsbIntercace(UINT8 cfg);
extern UINT8 USBOTG_HostEnum(PUSBHS_HOST pdev);
extern UINT8 HubGetPortStatus(UINT8 HubPortIndex);
extern UINT8 HubSetPortFeature(UINT8 HubPortIndex, UINT8 FeatureSelt);
extern UINT8 HubClearPortFeature(UINT8 HubPortIndex, UINT8 FeatureSelt);
extern void  Analysis_Descr(PUSBHS_HOST pusbdev,PUINT8 pdesc, UINT16 l);

#endif

